*&---------------------------------------------------------------------*
* 모듈/서브모듈    : MM/PR
* Program ID  : ZLMMGMC010
* Desc        : [MM] 구매요청 생성( 11 )
* Transaction : ZLMMGMC013
* Creator     : 류재열
* Create day  : 2026.06.16
*&---------------------------------------------------------------------*
*              변경이력
*-------  ----------    ---------------   -----------------------------
* No      Changed On    Changed by        C/R Number
* New     2026.06.16    류재열              최초작성
*&---------------------------------------------------------------------*

REPORT zlmmgmc040 MESSAGE-ID zsyms27.

INCLUDE ZLMMGMC040_TOP. " 전역 타입·변수·객체
INCLUDE ZLMMGMC040_SEL. " Selection Screen
INCLUDE ZLMMGMC040_C01. " ALV 이벤트 클래스
INCLUDE ZLMMGMC040_O01. " Screen PBO
INCLUDE ZLMMGMC040_I01. " Screen PAI
INCLUDE ZLMMGMC040_F01. " FORM 로직

*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*


*----------------------------------------------------------------------*
* END-OF-SELECTION
*----------------------------------------------------------------------*
END-OF-SELECTION.
  CHECK sy-batch = ''.
  CALL SCREEN 2000.
